{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Задача 4.2 (к лекции «Управляющие конструкции и коллекции» часть 2)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Дана переменная, в которой хранится список поисковых запросов пользователя (пример структуры данных приведен ниже). Вам необходимо написать программу, которая выведет на экран распределение количества слов в запросах в требуемом виде.\n",
    "\n",
    "Пример работы программы:\n",
    "\n",
    "queries = [\n",
    "‘смотреть сериалы онлайн’,\n",
    "‘новости спорта’,\n",
    "‘афиша кино’,\n",
    "‘курс доллара’,\n",
    "‘сериалы этим летом’,\n",
    "‘курс по питону’,\n",
    "‘сериалы про спорт’,\n",
    "]\n",
    "\n",
    "Результат:\n",
    "\n",
    "Поисковых запросов, содержащих 2 слов(а): 42.86%\n",
    "\n",
    "Поисковых запросов, содержащих 3 слов(а): 57.14%"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Поисковых запросов, содержащих 3 слов(а): 57.14%\n",
      "Поисковых запросов, содержащих 2 слов(а): 42.86%\n"
     ]
    }
   ],
   "source": [
    "queries = [ 'смотреть сериалы онлайн', 'новости спорта', 'афиша кино', 'курс доллара', 'сериалы этим летом', 'курс по питону', 'сериалы про спорт']\n",
    "\n",
    "# создаю переменную и присваиваю ей длину списка и создаю пустой словарь, куда будут заносится полученные результаты\n",
    "item_all = len(queries)\n",
    "calc_words = {}\n",
    "\n",
    "# первый цикл выискивает все новые ключи в списке, в данном случае количество слов в запросе, и присваивает им значение \"0\"\n",
    "\n",
    "for item in queries:\n",
    "    length = len(item.split(' '))\n",
    "    x = length\n",
    "    calc_words[x] = 0\n",
    "#print(calc_words)\n",
    "\n",
    "# второй цикл повторно пробегает по тому же списку, но, уже проводит подсчет, т.е. прибавляет 1 к значению. \n",
    "# этот цикл я сделал, так как у меня не получилось это сделать сразу в первом цикле, там только ключи создал, а здесь уже значениями заполнил\n",
    "for item in queries:\n",
    "    length = len(item.split(' '))\n",
    "    x = length\n",
    "    calc_words[x] += 1\n",
    "#print(calc_words)\n",
    "\n",
    "# третий цикл решает уже процентное соотношение найденных результатов\n",
    "for key, value in calc_words.items():\n",
    "    proc = value / item_all\n",
    "    print('Поисковых запросов, содержащих', key, 'слов(а): {:.2%}'.format(proc))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Ответ и что надо исправить))\n",
    "\n",
    "во второй задаче ваша реализация жестко привязана к исходным данным. Ваша задача написать универсальный алгоритм, который будет корректно работать на любых данных аналогичной структуры. А что если запросы будут состоять из любого количества слов от 1 до 1000? Вы же не будете вручную прописывать каждый случай (как сейчас). \n",
    "\n",
    "Просьба исправить реализацию в этом ключе. \n",
    "\n",
    "Я бы рекомендовал использовать в качестве <b> результирующей переменной - словарь </b>, а не списки, это сократило бы код. Ключами бы в нем были варианты количества слов в запросах, а значениями - количество таких запросов. Формировали бы его так же в цикле, проверяли бы наличие текущей длины в ключах, если есть, то наращиванием значение на 1."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Первоначальный вариант решения. \n",
    "Оставлю на память.\n",
    "\n",
    "queries = [ 'смотреть сериалы онлайн', 'новости спорта', 'афиша кино', 'курс доллара', 'сериалы этим летом', 'курс по питону', 'сериалы про спорт']\n",
    "\n",
    "item_all = len(queries)\n",
    "\n",
    "item_3 = 0\n",
    "item_2 = 0\n",
    "\n",
    "for item in queries:\n",
    "    if len(item.split(' ')) == 3:\n",
    "        item_3 += 1\n",
    "    if len(item.split(' ')) == 2:\n",
    "        item_2 += 1\n",
    "\n",
    "item_3_proc = item_3 / item_all # * 100\n",
    "item_2_proc = item_2 / item_all # * 100        \n",
    "\n",
    "print('Поисковых запросов, содержащих 2 слов(а): {:.2%}'.format(item_2_proc))\n",
    "print('Поисковых запросов, содержащих 3 слов(а): {:.2%}'.format(item_3_proc))\n",
    "    \n",
    "    #print(item, len(item), item.find('с'))\n",
    "\n",
    "#if len(item) == 3:\n",
    " #item_3 = item_3 + 1\n",
    "  #print(item_3)\n",
    "#print('Поисковых запросов, содержащих 2 слов(а): {:.1%}'.format(имя переменной))\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
