{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Задача 4.2 (к лекции «Управляющие конструкции и коллекции» часть 2)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Дана переменная, в которой хранится список поисковых запросов пользователя (пример структуры данных приведен ниже). Вам необходимо написать программу, которая выведет на экран распределение количества слов в запросах в требуемом виде.\n",
    "\n",
    "Пример работы программы:\n",
    "\n",
    "queries = [\n",
    "‘смотреть сериалы онлайн’,\n",
    "‘новости спорта’,\n",
    "‘афиша кино’,\n",
    "‘курс доллара’,\n",
    "‘сериалы этим летом’,\n",
    "‘курс по питону’,\n",
    "‘сериалы про спорт’,\n",
    "]\n",
    "\n",
    "Результат:\n",
    "\n",
    "Поисковых запросов, содержащих 2 слов(а): 42.86%\n",
    "\n",
    "Поисковых запросов, содержащих 3 слов(а): 57.14%"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Вопрос\n",
    "##### мне не нравится как я вывел итоговый результат. Если я правильно понимаю, то при оформлении выводящей строки проценты нужно(можно) как то так оформлять {:.2%}. Но, если я так делал, то результат был вот таким \"5714.29%\" вместо \"57.14%\". Где ошибка я так и не понял. Можете подсказать?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Поисковых запросов, содержащих 2 слов(а): 42.86%\n",
      "Поисковых запросов, содержащих 3 слов(а): 57.14%\n"
     ]
    }
   ],
   "source": [
    "queries = [ 'смотреть сериалы онлайн', 'новости спорта', 'афиша кино', 'курс доллара', 'сериалы этим летом', 'курс по питону', 'сериалы про спорт']\n",
    "\n",
    "item_all = len(queries)\n",
    "\n",
    "item_3 = 0\n",
    "item_2 = 0\n",
    "\n",
    "for item in queries:\n",
    "    if len(item.split(' ')) == 3:\n",
    "        item_3 += 1\n",
    "    if len(item.split(' ')) == 2:\n",
    "        item_2 += 1\n",
    "\n",
    "item_3_proc = item_3 / item_all * 100\n",
    "item_2_proc = item_2 / item_all * 100        \n",
    "\n",
    "print('Поисковых запросов, содержащих 2 слов(а): {:.2f}%'.format(item_2_proc))\n",
    "print('Поисковых запросов, содержащих 3 слов(а): {:.2f}%'.format(item_3 / item_all * 100))\n",
    "    \n",
    "    #print(item, len(item), item.find('с'))\n",
    "\n",
    "#if len(item) == 3:\n",
    " #   item_3 = item_3 + 1\n",
    "  #  print(item_3)\n",
    "#print('Поисковых запросов, содержащих 2 слов(а): {:.1%}'.format(имя переменной))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
